jarry050599/IYRC-2026/.arduino/data/packages/arduino/hardware/zephyr/0.90.0/boards.txt

##########################################################################################

# NOTE:
#
# The following board-specific properties are auto-generated by 'build.sh'
# and saved in 'boards.local.txt'. VALUES IN THIS FILE WILL HAVE NO EFFECT.
#
# - build.architecture
# - build.float-abi
# - build.fpu
# - build.mcu
# - upload.address
# - upload.maximum_data_size
# - upload.maximum_size

##########################################################################################

menu.debug=Debug
menu.link_mode=Link mode
menu.wait_linux_boot=Startup mode

##########################################################################################

##########################################################################################

##############################################################################################################

##############################################################################################################

##########################################################################################

##############################################################################################################

##############################################################################################################

##########################################################################################

##########################################################################################

# the space before -Q is important

##########################################################################################

##########################################################################################

##############################################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unoq.menu.link_mode.dynamic=Dynamic
unoq.menu.link_mode.static=Static
unoq.menu.link_mode.static.build.link_mode=static
unoq.menu.link_mode.static.upload.extension=bin-zsk.bin

unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
unoq.menu.wait_linux_boot.app=Wait for App
unoq.menu.wait_linux_boot.app.build.boot_mode=app

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr

unoq.openocd_cfg=flash_sketch.cfg
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.build.zephyr_hals=hal_stm32
unoq.build.zephyr_toolchain=arm-zephyr-eabi
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##############################################################################################################

##############################################################################################################

unoq.upload.address=0x08100000
unoq.upload.maximum_size=786432
unoq.upload.maximum_data_size=262144
unoq.build.architecture=cortex-m33
unoq.build.mcu=cortex-m33
unoq.build.fpu=fpv5-sp-d16
unoq.build.float-abi=hard

